{
  "broadArea": {
    "name": "Mechanical Engineering",
    "link": "https://www.vlab.co.in/broad-area-mechanical-engineering",
    "code": "MECH"
  },
  "lab": "Vibration Lab II",
  "lab_display_name": "Vibration Lab II",
  "phase": "3-ext",
  "collegeName": "NITK",
  "baseUrl": "vibration2-nitk.vlabs.ac.in",
  "introduction": "The Vibration Lab II is designed to provide students with a quick, visual, and hands-on approach to understanding key concepts in mechanical vibrations. This modern virtual lab focuses on the analysis of two-degree-of-freedom (2-DOF) systems, covering a wide range of topics such as free and forced vibration analysis, impulse response, dynamic vibration absorbers, and torsional systems. Through experiments like the free and forced vibration of a motor on a foundation, the response of a forging hammer to impulse excitation, the behavior of automotive vehicles under static and dynamic coupling, and the dynamics of a compound pendulum, students gain practical insights into vibration phenomena. The lab supports undergraduate and postgraduate courses, research scholars, and design-based learning, making it an essential tool for integrating vibration analysis into mechanical system design and development.",
  "experiments": [
  {
    "name": "Free Vibration Analysis of Two Degree of Freedom System",
    "short-name": "free-vibration-analysis-two-degree-freedom",
    "repo": "https://github.com/virtual-labs/exp-free-vibration-analysis-nitk",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Impulse Response Analysis of Two Degree of Freedom System",
    "short-name": "impulse-response-analysis-two-degree-freedom",
    "repo": "https://github.com/virtual-labs/exp-impulse-response-analysis-nitk",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Tuned Dynamic Vibration Absorber",
    "short-name": "tuned-dynamic-vibration-absorber",
    "repo": "https://github.com/virtual-labs/exp-tuned-dynamic-vibration-absorber-nitk",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Motor on a Foundation as a Two Degree of Freedom System - Free vibration",
    "short-name": "motor-foundation-two-degree",
    "repo": "https://github.com/virtual-labs/exp-two-degree-freedom-system-nitk",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Motor on a Foundation as a Two Degree of Freedom System-Forced vibration with rotating unbalance",
    "short-name": "motor-foundation-two-degree-rotating-unbalance",
    "repo": "https://github.com/virtual-labs/exp-freedom-system-forced-vibration-nitk",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Forging hammer as a Two Degree of Freedom System - Free vibration",
    "short-name": "forging-hammer-two-degree-freedom",
    "repo": "https://github.com/virtual-labs/exp-forging-hammer-nitk",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Forging hammer as a Two Degree of Freedom System - Impulse excitation",
    "short-name": "forging-hammer-system-impulse-excitation",
    "repo": "https://github.com/virtual-labs/exp-forging-hammer-impulse-excitation-nitk",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Automotive vehicle as a Two Degree of Freedom System - Static and Dynamics coupling",
    "short-name": "automotive-vehicle-static-dynamics-coupling",
    "repo": "https://github.com/virtual-labs/exp-static-dynamics-coupling-nitk",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Torsional System of Two Degree of Freedom",
    "short-name": "torsional-system-two-degree-freedom",
    "repo": "Ehttps://github.com/virtual-labs/exp-torsional-system-nitk",
    "tag": "v1.0.0",
    "deploy": true
  },
  {
    "name": "Compound Pendulum",
    "short-name": "compound-pendulum",
    "repo": "https://github.com/virtual-labs/exp-compound-pendulum-nitk",
    "tag": "v1.0.0",
    "deploy": true
  }
],
  "targetAudience": {
    "UG": [
      "Mechanical Engineering, Automobile Engineering, Production Engineering - 3rd year / 4th year"
    ],
    "PG": [
      "Industrial Engineering, Machine Design, Mechatronics"
    ]
  },
  "objective": "The intention of developing a Vibrational lab is to provide a quick, easy and visual process for students to start experimenting with and learn concepts of Vibrations. Vibration Laboratory is a modern facility for performing a wide range of experiments in the field of vibration. The goal of this lab is to demonstrate students how to do vibration analysis on mechanical components. The Lab supports undergraduate courses, postgraduate courses, research scholars, student projects and advanced experimental research. Students can use the Mechanical Vibrations Laboratory to include vibration analysis into the design, development, and optimization of products. This lab also provides resources for design projects involving dynamics, vibrations, and control principles and applications.",
  "courseAlignment": {
    "description": "The syllabi of this lab aligns to the following universities in India.",
    "universities": [
      "Machine Dynamics and Vibrations - National Institute of Technology Karnataka Surathkal. Karnataka, ME351, B.Tech.",
      "Mechanical Vibrations and Acoustics - National Institute of Technology Karnataka Surathkal. Karnataka, ME420, B.Tech.",
      "Dynamics of Machines - West Bengal University of Technology, ME 605,B.Tech.",
      "Dynamics of Machines - Visvesvaraya Technological University Karnataka, 18ME53, B.E.",
      "Vibrations and Noise Engineering - Visvesvaraya Technological University Karnataka, 18ME644, B.E.",
      "Mechanical Vibrations - Vellore Institute of Technology, Vellore, MEE3008, B.tech."
    ]

  } 
}
